/* 다음 내용에 맞는 프로그램을 작성하시오
*
* char형 변수 1개 선언 및 초기화
* 키보드로부터 문자를 입력 받음
* 예외 처리 필수
* if ~else if ~ else구문을 사용하여 대문자, 소문자, 숫자 인지를 판별
*
* 실행 결과 - 1
* 문자를 입력하시오 : Q
* 입력한 Q는 "알파벳 대문자"
*
* 실행 결과 - 2
* 문자를 입력하시오 : &
* 입력한 &는 "기타 문자"
*
* 실행 결과 - 3
* 입력한 9는 "숫자 문자"
*/

#include<iostream>
using namespace std;

/*
int main()
{
	char ch = ' ';

	cout << "문자를 입력하시오 : ";
	cin >> ch;

	// 대문자 인지를 확인
	if (ch >= 'A' && ch <= 'Z')
	{
		cout << "입력한 문자" << ch << "은 \'알파벳 대문자\'" << endl;
	}
	// 소문자 인지를 확인
	else if (ch >= 'a' && ch <= 'z')
	{
		cout << "입력한 문자" << ch << "은 \'알파벳 대문자\'" << endl;
	}
	else if (ch >= '0' && ch <= '9')
	{
		cout << "입력한 문자" << ch << "은 \'숫자 문자\'" << endl;
	}
	else
	{
		cout << "입력한 문자" << ch << "은 \'기타 문자\'" << endl;
	}

	return 0;
}
*/